import s from'./Main.module.css';


export const Main = (props) => {
	return <div className={s.conteiner}>
		<div className={s.content}>
			<p><h3>Как войти в IT?</h3></p>
			<p>
				Что нужно знать, ведь IT-индустрия безгранична, подобно океану? Как устроится на первую работу, ведь всем работодателям нужны люди с опытом разработки? А смогу ли я осилить это, ведь это что-то запредельно сложное и только для избранных? 
			</p>
			<p>
				Все эти вопросы встают перед многими, кто захотел связать свою карьеру с IT или же осмелился сменить уже освоенную профессию на другую, более интересную, но сложную. Эти растерянность и неуверенность в себе сейчас одолевают и меня, печатающего эти строки, пока ещё не нашедшего своего работодателя. Но нужно  надеется на лучшее, не унывать, прокачиваться дальше и тогда все получится!
			</p>
			<p>
				Почему я так в этом уверен? Да всё просто, на самом деле! Да, IT-индустрия действительно огромна, но нам не нужно знать все, никто этого не требует от Вас. Работодателю нужен человек, умеющий выполнять работу, приносящую прибыль. А для этого необходимо обладать некоторым определенным набором навыков, вполне конечным, под вполне определённые задачи. Для разных сфер IT этот набор разный и требует разного времени для изучения. Поэтому идем по пути наименьшего сопротивления и выбираем front-end разработку, так как это самый быстрый способ стать полезными работодателю. Освоив базовый набор инструментов, Вы сможете выполнять несложные  и зачастую повторяющиеся задачи, разгрузив более опытных сотрудников, и будете набираться опыта и расти дальше.
			</p>
			<p>
				Как же войти в IT? Опять же все просто: пройдите все шаги, указанные на данном сайте. Всего 8 маленьких шажочков, по сравнению со всей нашей жизнью, это капля в море, ну, может пару ведер воды. Главное правило: Вы должны уделять на обучение возможно не так немного времени, но обязательно каждый день, без перерывов и прочих отговорок – полчасика всегда можно выделить из своего дня, как бы он ни был загружен. И так день за днем Вы и не заметите как уже стали программистом, даже того не осознавая! Похоже на магию, но так устроен наш мозг – скармливая ему информацию в небольших объемах, но постоянно и методично, мы начинаем меняться, меняется наш мозг, программирование входит в привычку, и нам уже не нужно прилагать титанические усилия, мозг сам хочет новой информации, которая ложится на фундамент предыдущих знаний,  укрепив его и дав возможность двигаться дальше!
			</p>
			<p>
				И даже больше – вы будете удивлены, когда обнаружите, что провели за решением какой-нибудь задачи часа четыре подряд и даже не заметили этого! Программирование станет вашей жизнью, а Вы станете программистом, а вопрос трудоустройства станет лишь вопросом времени. Для этого не нужно будет переплывать океан  - сделайте лишь пару шагов навстречу к судьбе и посмотрите вперед. Осознайте после этого, что у вас за плечами уже есть огромный опыт, который обязательно пригодится работодателю. И для этого Вам не придется заново придумывать теорию относительности, разрабатывать лекарство от рака или рождаться с геном программиста – просто уделяйте полчаса в день, ведь это очень просто, не так ли? Программистом может стать каждый: от школьника до полковника, от домохозяйки до пенсионерки. Отбросьте все страхи, предубеждения и неуверенность в себе и у Вас всё обязательно получится!
			</p>
			<p>
				На этом сайте собраны воедино все необходимые источники, которые вам пригодятся при изучении. 
				Пройди сам все шаги, указанные в меню навигации сверху, и все свершится! Летим в космос!
			</p>
		</div>
	</div>
}